#include<stdio.h>
#include<stdlib.h>



//假设对于任意一种药品，每天开始工作时的库存总量已知，并且一天之内不会通过进货的方式增加。
//每天会有很多病人前来取药，每个病人希望取走不同数量的药品。如果病人需要的数量超过了当时的库存量，
//药房会拒绝该病人的请求。管理员希望知道每天会有多少病人没有取上药。

//输入共3行
//第一行是每天开始时的药品总量m
//第二行是这一天取药的人数n（0 < n <= 100）
//第三行共有n个数，分别记录了每个病人希望取走的药品数量（按照时间先后的顺序）
//，两数之间以空格分隔输出只有1行，为这一天没有取上药品的人数。
int main()
{
	int m,n;
	int x[101];
	scanf("%d %d",&m,&n);
	for(int i=1;i<=n;i++)
	{
		scanf("%d",&x[i]);
	}
	
	int no=0;
	for(int i=1;i<=n;i++)
	{
		if(m>=x[i])
		{
			m-=x[i];
		}
		else
		{
			no++;
		}
	}
	
	printf("%d",no);
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	return 0;
}
